<a href="https://colab.research.google.com/github/19pa1a0227/AI-Lab-/blob/master/Experiment_2_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Experiment 2 Pandas

## 1) Create a dataframe manually.

In [69]:
import numpy as np   
import pandas as pd

In [70]:
df = pd.DataFrame([["CSE501","A.RAMU"],["CSE502","B.RAJESH"],["CSE503","B.SUBBU"]], columns=["Roll No","Name"])
df

  Roll No      Name
0  CSE501    A.RAMU
1  CSE502  B.RAJESH
2  CSE503   B.SUBBU

## 2)  Import data into a dataframe

In [71]:
stu_data = pd.read_csv("students_placement_data.csv")
stu_data.head()

   Roll No Gender  ... registered_for_ Placement_Training  placement status
0        1      M  ...                                 NO        Not placed
1        2      F  ...                                yes            Placed
2        3      F  ...                                yes        Not placed
3        4      M  ...                                yes        Not placed
4        5      M  ...                                yes        Not placed

[5 rows x 9 columns]

In [72]:
stu_data.isna().any()

Roll No                               False
Gender                                False
Section                               False
SSC Percentage                         True
inter_Diploma_percentage              False
B.Tech_percentage                     False
Backlogs                              False
registered_for_ Placement_Training     True
placement status                      False
dtype: bool

In [73]:
stu_data.describe()

          Roll No  SSC Percentage  ...  B.Tech_percentage    Backlogs
count  117.000000      116.000000  ...         117.000000  117.000000
mean    59.000000       80.474569  ...          62.943419    4.111111
std     33.919021        8.836079  ...          12.064306    6.335148
min      1.000000       47.800000  ...          31.200000    0.000000
25%     30.000000       76.622500  ...          54.180000    0.000000
50%     59.000000       82.745000  ...          64.360000    0.000000
75%     88.000000       87.025000  ...          72.570000    7.000000
max    117.000000       93.660000  ...          88.100000   25.000000

[8 rows x 5 columns]

In [74]:
stu_data.shape

(117, 9)

### 3.1) Adding an extra column "hostler/day's scholar" to stu_data

 Add an extra column "hostler/day's scholar" to studentâ€™s data

In [75]:
h=pd.read_csv("hostlers_day_scholars.csv")

In [76]:
h.shape

(117, 1)

In [77]:
stu_data["Hostler/Day_Scholar"] = h.values
stu_data.head()

   Roll No Gender  ... placement status  Hostler/Day_Scholar
0        1      M  ...       Not placed                    d
1        2      F  ...           Placed                    d
2        3      F  ...       Not placed                    d
3        4      M  ...       Not placed                    d
4        5      M  ...       Not placed                    h

[5 rows x 10 columns]

### 3.2) Deleting a column

 "registered_for_ Placement_Training" is no more needed. So delete it

In [80]:
del stu_data["registered_for_ Placement_Training"]
stu_data.tail()

    Roll No Gender Section  ... Backlogs placement status Hostler/Day_Scholar
113     114      M       B  ...        0       Not placed                   h
114     115      M       B  ...        0       Not placed                   h
115     116      M       B  ...        0       Not placed                   h
116     117      M       B  ...        0       Not placed                   d
117     118      F       C  ...        0       Not placed                   h

[5 rows x 9 columns]

### 3.3) Adding a row

In [ ]:
new_stu=pd.DataFrame({"Roll No":[118],"Gender":["F"],"Section":["C"],"SSC Percentage":[98.4],"inter_Diploma_percentage":[99],"B.Tech_percentage":[75],"Backlogs":[0],"Hostler/Day_Scholar":["h"],"placement status":["Not placed"]},index=[117])
new_stu

    Roll No Gender Section  ... Backlogs Hostler/Day_Scholar placement status
117     118      F       C  ...        0                   h       Not placed

[1 rows x 9 columns]

In [81]:
stu_data = stu_data.append(new_stu)
stu_data.head()

  Roll No Gender Section  ... Backlogs placement status Hostler/Day_Scholar
0       1      M       A  ...       18       Not placed                   d
1       2      F       A  ...        0           Placed                   d
2       3      F       A  ...       13       Not placed                   d
3       4      M       A  ...       17       Not placed                   d
4       5      M       A  ...       17       Not placed                   h

[5 rows x 9 columns]

### 3.4) Deleting a row

In [82]:
stu_data.drop(3).head()

  Roll No Gender Section  ... Backlogs placement status Hostler/Day_Scholar
0       1      M       A  ...       18       Not placed                   d
1       2      F       A  ...        0           Placed                   d
2       3      F       A  ...       13       Not placed                   d
4       5      M       A  ...       17       Not placed                   h
5       6      M       A  ...        6       Not placed                   h

[5 rows x 9 columns]

### 3.5) Modifying elements

In [83]:
stu_data.loc[1,"Hostler/Day_Scholar"]="h"
stu_data.head()

  Roll No Gender Section  ... Backlogs placement status Hostler/Day_Scholar
0       1      M       A  ...       18       Not placed                   d
1       2      F       A  ...        0           Placed                   h
2       3      F       A  ...       13       Not placed                   d
3       4      M       A  ...       17       Not placed                   d
4       5      M       A  ...       17       Not placed                   h

[5 rows x 9 columns]

## 4) Applying functions on a dataframe.

In [26]:
def give_grace(x):
  if x<70:
    return(x+0.005)
  else:
    return(x)

In [44]:
stu_data['B.Tech_percentage'].apply(give_grace)
stu_data.head()

   Roll No Gender Section  ...  Backlogs  placement status  Hostler/Day_Scholar
0        1      M       A  ...        18        Not placed                    d
1        2      F       A  ...         0            Placed                    d
2        3      F       A  ...        13        Not placed                    d
3        4      M       A  ...        17        Not placed                    d
4        5      M       A  ...        17        Not placed                    h

[5 rows x 9 columns]

## 5) Iterations on dataframe

In [45]:
for index,rows in stu_data[stu_data["B.Tech_percentage"]>=80].iterrows():
  print(rows["Roll No"],"-",rows["B.Tech_percentage"])

18 - 85.39
60 - 81.1
71 - 80.47
97 - 88.1
102 - 83.38

## 6) Accessing the elements from a dataframe

In [46]:
stu_data.loc[[1,2],["SSC Percentage","inter_Diploma_percentage"]]

   SSC Percentage  inter_Diploma_percentage
1            89.0                      92.4
2            67.0                      68.0

##  7) Different ways to deal with NAâ€™s in dataframe

In [47]:
stu_data["SSC Percentage"] = stu_data["SSC Percentage"].replace(to_replace=np.nan,value=np.mean(stu_data["SSC Percentage"]))
stu_data.head()

   Roll No Gender Section  ...  Backlogs  placement status  Hostler/Day_Scholar
0        1      M       A  ...        18        Not placed                    d
1        2      F       A  ...         0            Placed                    d
2        3      F       A  ...        13        Not placed                    d
3        4      M       A  ...        17        Not placed                    d
4        5      M       A  ...        17        Not placed                    h

[5 rows x 9 columns]

## 8) Groupby operations on dataframe

In [49]:
s= stu_data.groupby("Gender")
s["B.Tech_percentage"].agg(np.mean)

Gender
F    71.199388
M    56.994265
Name: B.Tech_percentage, dtype: float64

## 9) Merging the dataframes

In [50]:
w= pd.read_csv("urban_rural.csv")
w.head()

   Roll No Urban/Rural
0        1       Urban
1        2       Rural
2        6       Rural
3        7       Urban
4        8       Urban

In [51]:
w.shape

(117, 2)

In [53]:
stu_data=pd.merge(stu_data,w,on="Roll No")
stu_data.head()

   Roll No Gender Section  ...  placement status  Hostler/Day_Scholar  Urban/Rural
0        1      M       A  ...        Not placed                    d        Urban
1        2      F       A  ...            Placed                    d        Rural
2        3      F       A  ...        Not placed                    d        Urban
3        4      M       A  ...        Not placed                    d        Urban
4        5      M       A  ...        Not placed                    h        Urban

[5 rows x 10 columns]